In [4]:
import pandas as pd
import numpy as np
import mysql.connector 
from mysql.connector import Error
from urllib.parse import quote_plus
from sqlalchemy import create_engine

In [5]:
def create_connection(host_name, user_name, user_password, db_name):
    connection = None
    user_password = quote_plus(user_password)
    try:
        connection = mysql.connector.connect(host=host_name, user=user_name, passwd=user_password, database=db_name)
        print("Connection successful")
    except Error as e:
        print(f"The error {e} occured")
    return connection

In [6]:
source_conn= create_connection("localhost", "root", "root", "car_accident_staging_db")

Connection successful

In [7]:
cursor = source_conn.cursor()
engine = create_engine(f'mysql+pymysql://root:root@localhost:3306/car_accident_staging_db')

# Users Table

In [8]:
query = "select * from car_accident_staging_db.users"
cursor.execute(query)
data = cursor.fetchall()
col_names = [i[0] for i in cursor.description]
df_users = pd.DataFrame(data, columns = col_names)
df_users.head(10)

,Num_Acc,place,catu,grav,sexe,trajet,secu,locp,actp,etatp,an_nais,num_veh
0,201600000001,1,1,1,2,0,11,0,0,0,1983,B02
1,201600000001,1,1,3,1,9,21,0,0,0,2001,A01
2,201600000002,1,1,3,1,5,11,0,0,0,1960,A01
3,201600000002,2,2,3,1,0,11,0,0,0,2000,A01
4,201600000002,3,2,3,2,0,11,0,0,0,1962,A01
5,201600000003,1,1,1,1,1,11,0,0,0,1997,A01
6,201600000003,NA,3,3,1,5,NA,6,2,1,1970,A01
7,201600000004,1,1,3,1,5,23,0,0,0,1999,B02
8,201600000004,2,2,4,1,0,23,0,0,0,1999,B02
9,201600000004,1,1,1,2,0,11,0,0,0,1985,A01

In [9]:
def missing_data(data):
    # Replace empty strings or specific placeholders with NaN
    data = data.replace('', np.nan).replace(' ', np.nan).replace('NA', np.nan).replace('None', np.nan)
    
    # Calculate total missing values and their percentage
    total = data.isnull().sum().sort_values(ascending=False)
    percent = (data.isnull().sum() / data.isnull().count() * 100).sort_values(ascending=False)
    
    # Combine results into a DataFrame
    missing_data_df = pd.concat([total, percent], axis=1, keys=['Total NaN Values', 'Percentage of NaN Values'])
    
    return missing_data_df

missing_data(df_users)

         Total NaN Values  Percentage of NaN Values
place              100366                  5.349986
secu                43458                  2.316518
an_nais              2351                  0.125319
actp                 1773                  0.094509
etatp                1706                  0.090938
locp                 1664                  0.088699
trajet                369                  0.019669
Num_Acc                 0                  0.000000
catu                    0                  0.000000
grav                    0                  0.000000
sexe                    0                  0.000000
num_veh                 0                  0.000000

In [10]:
columns_to_convert = ['place', 'catu', 'grav','trajet', 'secu', 'locp', 'actp', 'etatp', 'an_nais', 'Num_Acc']

# Replace non-numeric values with NaN and convert columns to nullable integer type
df_users[columns_to_convert] = df_users[columns_to_convert].apply(pd.to_numeric, errors='coerce').astype('Int64')

In [11]:
#Missing Values
df_users = df_users.replace(['', ' ', 'NA', 'None'], np.nan)
df_users = df_users.dropna(subset = ['secu','an_nais','trajet'])

In [12]:
df_users.drop(['etatp','actp','locp','place'],axis = 1 , inplace = True)

In [13]:
#User category (catu)

df_users['catu'] = df_users['catu'].replace({4:3})

data = {
    "catu": [1, 2, 3],
    "Category": ["Driver", "Passenger", "Pedestrian"]
}
df_users_category = pd.DataFrame(data)

df_users_category.to_csv("users_category.csv",index = False)

In [14]:
#Severity level (grav)
data = {
    "grav": [1, 2, 3, 4],
    "Severity": ["Unscathed", "Killed", "Hospitalized", "Light injury"]
}
df_users_severity = pd.DataFrame(data)

df_users_severity.to_csv("users_severity.csv",index = False)

In [15]:
# Gender (sexe)
df_users["sexe"] = df_users["sexe"].replace({1: "Male", 2: "Female"})

In [16]:
#Reason of travelling (trajet)
data = {
    "trajet": [0, 1, 2, 3, 4, 5, 9],
    "Reason": ["Unknown","Work", "School", "Shopping", "Professional Use", "Leisure","Other"]
}
df_users_reason = pd.DataFrame(data)

df_users_reason.to_csv("users_reason.csv",index = False)

In [17]:
# Step 1: Fill missing values in 'secu' and convert to string
df_users["secu"] = df_users["secu"].fillna("00").astype(str)

# Step 2: Create new columns 'safety_existence' and 'safety_use'
df_users["safety_existence"] = df_users["secu"].str[0]
df_users["safety_use"] = df_users["secu"].str[1]

# Step 3: Convert the new columns to integers (optional)
df_users["safety_existence"] = pd.to_numeric(df_users["safety_existence"], errors='coerce').astype('Int64')
df_users["safety_use"] = pd.to_numeric(df_users["safety_use"], errors='coerce').astype('Int64')

In [18]:
df_users.head()

,Num_Acc,catu,grav,sexe,trajet,secu,an_nais,num_veh,safety_existence,safety_use
0,201600000001,1,1,2,0,11,1983,B02,1,1
1,201600000001,1,3,1,9,21,2001,A01,2,1
2,201600000002,1,3,1,5,11,1960,A01,1,1
3,201600000002,2,3,1,0,11,2000,A01,1,1
4,201600000002,2,3,2,0,11,1962,A01,1,1

In [19]:
(df_users['safety_existence'] == 0).sum()/len(df_users)
# 0 is unknown and it is only 0.03 % so i will drop them

0.03727036645186112

In [20]:
# Drop rows where 'safety_existence' is 0
df_users = df_users[df_users['safety_existence'] != 0]

# Reset the index if needed (optional)
df_users.reset_index(drop=True, inplace=True)

In [21]:
(df_users['safety_use'] == 0).sum()/len(df_users)
#it is 0.003 so i will drop it

0.0036488063612295594

In [22]:
# Drop rows where 'safety_use' is 0
df_users = df_users[df_users['safety_use'] != 0]

# Reset the index if needed (optional)
df_users.reset_index(drop=True, inplace=True)

In [23]:
#Safety existence (safety_existence)
data = {
    "safety_existence": [1, 2, 3, 4, 9],
    "Safety_Equipment": ["Belt","Helmet", "Children's device", "Reflective equipment", "Other"]
}
df_users_safety_existence = pd.DataFrame(data)

df_users_safety_existence.to_csv("users_safety_existence.csv",index = False)

In [24]:
#Safety use (safety_use)
data = {
    "safety_use": [1, 2, 3],
    "Used": ["Yes","No", "Not determinable"]
}
df_users_safety_use = pd.DataFrame(data)

df_users_safety_use.to_csv("users_safety_use.csv",index = False)

In [25]:
df_users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1751296 entries, 0 to 1751295
Data columns (total 10 columns):
 #   Column            Dtype
---  ------            -----
 0   Num_Acc           Int64
 1   catu              Int64
 2   grav              Int64
 3   sexe              object
 4   trajet            Int64
 5   secu              object
 6   an_nais           Int64
 7   num_veh           object
 8   safety_existence  Int64
 9   safety_use        Int64
dtypes: Int64(7), object(3)
memory usage: 145.3+ MB

# Vehicles Table

In [26]:
query = "select * from car_accident_staging_db.vehicles"
cursor.execute(query)
data = cursor.fetchall()
col_names = [i[0] for i in cursor.description]
df_vehicles = pd.DataFrame(data, columns = col_names)
df_vehicles.head(10)

        Num_Acc senc catv occutc obs obsm choc manv num_veh
0  201600000001    0    7      0   0    0    1    1     B02
1  201600000001    0    2      0   0    0    7   15     A01
2  201600000002    0    7      0   6    0    1    1     A01
3  201600000003    0    7      0   0    1    6    1     A01
4  201600000004    0   32      0   0    0    1    1     B02
5  201600000004    0    7      0   0    0    8   15     A01
6  201600000005    0   30      0   0    2    1   15     B02
7  201600000005    0    7      0   0    2    3    1     A01
8  201600000006    0    7      0   0    1    1    1     A01
9  201600000007    1   30      0   0    0    3   15     A01

In [27]:
missing_data(df_vehicles)

         Total NaN Values  Percentage of NaN Values
obs                   762                  0.053161
obsm                  601                  0.041929
manv                  306                  0.021348
choc                  229                  0.015976
senc                   72                  0.005023
Num_Acc                 0                  0.000000
catv                    0                  0.000000
occutc                  0                  0.000000
num_veh                 0                  0.000000

In [28]:
df_vehicles = df_vehicles.replace(['', ' ', 'NA', 'None'], np.nan)
df_vehicles=df_vehicles.dropna()

In [29]:
df_vehicles.drop(['senc','manv','choc','manv','occutc','obs','obsm'],axis = 1 ,inplace = True)

In [30]:
df_vehicles['catv'] = pd.to_numeric(df_vehicles['catv'], errors='coerce')
df_vehicles.loc[df_vehicles['catv'] > 13, 'catv'] = df_vehicles['catv'].astype(str).str[0].astype(int)

In [31]:
df_vehicles['catv'] = df_vehicles['catv'].replace({2:1 , 3:1 , 4:1 , 5:1 , 6:1})
df_vehicles['catv'] = df_vehicles['catv'].replace({7:2 , 8:2 , 9:2})
df_vehicles['catv'] = df_vehicles['catv'].replace({10:3 , 11:3 , 12:3})
df_vehicles['catv'] = df_vehicles['catv'].replace({13:4})

#Vehicle Category (catv)
data = {
    "catv": [1, 2, 3, 4],
    "Category": [" Bicycle and Motors", "Cars", "Vans", "Trucks"]
}
df_vehicles_category = pd.DataFrame(data)

df_vehicles_category.to_csv("vehicles_category.csv",index = False)

In [33]:
# Car company, Car and wheels condition are added
new_df_vehicles = pd.read_csv('new_vehicles2.csv')
new_df_vehicles.head(10)

        Num_Acc  catv num_veh car_condition wheels_condition vehicle_company
0  201600000001     2     B02       Average             Poor         Citroën
1  201600000001     1     A01          Poor          Average          Ducati
2  201600000002     2     A01          Poor          Average         Citroën
3  201600000003     2     A01       Average          Average           Tesla
4  201600000004     1     B02          Poor          Average          Yamaha
5  201600000004     2     A01          Poor          Average             BMW
6  201600000005     1     B02          Good             Good          Ducati
7  201600000005     2     A01          Poor          Average           Tesla
8  201600000006     2     A01       Average             Good         Citroën
9  201600000007     1     A01       Average             Good          Ducati

In [34]:
new_df_vehicles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1432040 entries, 0 to 1432039
Data columns (total 6 columns):
 #   Column            Non-Null Count    Dtype
---  ------            --------------    -----
 0   Num_Acc           1432040 non-null  int64
 1   catv              1432040 non-null  int64
 2   num_veh           1432040 non-null  object
 3   car_condition     1432040 non-null  object
 4   wheels_condition  1432040 non-null  object
 5   vehicle_company   1432040 non-null  object
dtypes: int64(2), object(4)
memory usage: 65.6+ MB

In [35]:
new_df_vehicles['car_condition'].value_counts()

car_condition
Poor       715445
Average    430071
Good       286524
Name: count, dtype: int64

# Characteristics Table

In [36]:
query = "select * from car_accident_staging_db.caracteristics"
cursor.execute(query)
data = cursor.fetchall()
col_names = [i[0] for i in cursor.description]
df_characteristics = pd.DataFrame(data, columns = col_names)
df_characteristics.head(10)

,Num_Acc,an,mois,jour,hrmn,lum,agg,inter,atm,col,com,adr,gps,lat,longi,dep
0,201600000001,16,2,1,1445,1,2,1,8,3,5,"46, rue Sonneville",M,0,0,590
1,201600000002,16,3,16,1800,1,2,6,1,6,5,1a rue du cimeti�re,M,0,0,590
2,201600000003,16,7,13,1900,1,1,1,1,6,11,,M,0,0,590
3,201600000004,16,8,15,1930,2,2,1,7,3,477,52 rue victor hugo,M,0,0,590
4,201600000005,16,12,23,1100,1,2,3,1,3,11,rue Joliot curie,M,0,0,590
5,201600000006,16,12,23,1115,1,2,1,7,6,11,Rue Jean-baptiste LEBAS,M,0,0,590
6,201600000007,16,5,1,1145,1,2,1,7,2,51,rue Jules FERRY,M,0,0,590
7,201600000008,16,5,14,1915,2,1,1,1,1,250,,M,0,0,590
8,201600000009,16,9,23,1900,1,2,1,1,3,51,rn41,M,0,0,590
9,201600000010,16,12,30,1030,1,1,1,9,6,303,,M,0,0,590

In [37]:
df_characteristics['Country'] = 'France'

In [38]:
# Convert 'an' to full year format
df_characteristics['an'] = df_characteristics['an'].astype(int) + 2000
#df_characteristics['mois'] = df_characteristics['mois'].astype(int)
#df_characteristics['jour'] = df_characteristics['jour'].astype(int)


df_characteristics['date'] = pd.to_datetime(df_characteristics[['an', 'mois', 'jour']].astype(str).agg('-'.join, axis=1), format='%Y-%m-%d')

# Format the date as 'dd/mm/yyyy'
df_characteristics['date'] = df_characteristics['date'].dt.strftime('%d/%m/%Y')

In [39]:
missing_data(df_characteristics)

         Total NaN Values  Percentage of NaN Values
longi              477518                 56.848396
lat                477514                 56.847920
gps                473759                 56.400888
adr                140542                 16.731489
atm                    55                  0.006548
col                    11                  0.001310
com                     2                  0.000238
Country                 0                  0.000000
dep                     0                  0.000000
Num_Acc                 0                  0.000000
an                      0                  0.000000
inter                   0                  0.000000
agg                     0                  0.000000
lum                     0                  0.000000
hrmn                    0                  0.000000
jour                    0                  0.000000
mois                    0                  0.000000
date                    0                  0.000000

In [40]:
df_characteristics=df_characteristics.drop(['an','mois','jour','lat','longi','gps','adr','com','atm','agg'],axis=1)

In [41]:
columns_to_convert = ['Num_Acc', 'lum','inter', 'col','dep']

# Replace non-numeric values with NaN and convert columns to nullable integer type
df_characteristics[columns_to_convert] = df_characteristics[columns_to_convert].apply(pd.to_numeric, errors='coerce').astype('Int64')

In [42]:
#df_characteristics['hour'] = df_characteristics['hrmn'].astype(str).apply(lambda x: x[:-2] if len(x) > 2 else x)
df_characteristics['hrmn'] = df_characteristics['hrmn'].astype('float64')
df_characteristics['hour'] = df_characteristics['hrmn']/100
df_characteristics['hour'] = df_characteristics['hour'].astype('int64')

In [43]:
df_characteristics.drop(['hrmn'],axis = 1 , inplace = True)

In [44]:
df_characteristics.sample(10)

             Num_Acc  lum  inter  col  dep Country        date  hour
86426   201500026995    1      1    6  440  France  07/01/2015    16
447093  200900012154    3      1    7  330  France  23/03/2009     0
670986  200600001021    2      2    3  330  France  09/01/2006     8
581586  200800072238    1      1    6  710  France  13/12/2008    12
322198  201100023612    1      2    3  180  France  06/05/2011    18
682434  200600012469    1      1    7  420  France  13/03/2006    12
179865  201300001926    1      6    1  490  France  08/08/2013    12
479392  200900044453    1      3    1  130  France  05/05/2009    12
376757  201000011197    3      1    6  890  France  12/08/2010    21
76077   201500016646    5      1    6  140  France  02/10/2015    21

In [45]:
# Drop rows with missing values in 'col' column
df_characteristics= df_characteristics.dropna(subset=['col'])

In [46]:
#Lighting (lum)

data = {
    "lum": [1, 2, 3, 4, 5],
    "Category": ["Full Day", "Dawn", "Night without public lighting", "Night with public lighting not lit","Night with public lighting on"]
}
df_characteristic_lighting = pd.DataFrame(data)

df_characteristic_lighting.to_csv("Characteristic_lighting.csv",index = False)

In [47]:
df_characteristics['inter'].value_counts()

inter
1    599646
2    103003
3     73774
6     22358
9     13247
4     11481
5      9364
7      6075
8       920
0       106
Name: count, dtype: Int64

In [48]:
df_characteristics.drop(df_characteristics[df_characteristics['inter'] == 0 ].index, inplace = True)

In [49]:
#Intersection (inter)

df_characteristics['inter'] = df_characteristics['inter'].replace({ 7:9 , 8:9 })


data = {
    "inter": [1, 2, 3, 4, 5, 6, 9],
    "Category": ["Out of intersection", "Intersection in X", "Intersection in T", "Intersection in Y","Intersection with more than 4 branches","Giratory","Other intersection"]
}
df_characteristic_intersection = pd.DataFrame(data)

df_characteristic_intersection.to_csv("Characteristic_intersection.csv",index = False)

In [50]:
#Collision (col)

df_characteristics['col'] = df_characteristics['col'].replace({ 2:1 , 3:1})
df_characteristics['col'] = df_characteristics['col'].replace({ 4:2 , 5:2})
df_characteristics['col'] = df_characteristics['col'].replace({ 6:3 })
df_characteristics['col'] = df_characteristics['col'].replace({ 7:4 })

data = {
    "col": [1, 2, 3, 4],
    "Category": ["Two vehicles", "Three vehicles and more vehicles","Other collision","Without collision"]
}
df_characteristic_collision = pd.DataFrame(data)

df_characteristic_collision.to_csv("Characteristic_collision.csv",index = False)

In [51]:
df_characteristics.head(10)

        Num_Acc  lum  inter  col  dep Country        date  hour
0  201600000001    1      1    1  590  France  01/02/2016    14
1  201600000002    1      6    3  590  France  16/03/2016    18
2  201600000003    1      1    3  590  France  13/07/2016    19
3  201600000004    2      1    1  590  France  15/08/2016    19
4  201600000005    1      3    1  590  France  23/12/2016    11
5  201600000006    1      1    3  590  France  23/12/2016    11
6  201600000007    1      1    1  590  France  01/05/2016    11
7  201600000008    2      1    1  590  France  14/05/2016    19
8  201600000009    1      1    1  590  France  23/09/2016    19
9  201600000010    1      1    3  590  France  30/12/2016    10

In [52]:
# This is an external data for regions
df_regions = pd.read_csv('departments_with_regions.csv')
df_regions.drop(['dep_corrected'],axis = 1 , inplace = True)
df_regions

    dep           region
0   590  Hauts-de-France
1   620  Hauts-de-France
2    20  Hauts-de-France
3   570        Grand Est
4   760        Normandie
..  ...              ...
88  972       Martinique
89  971       Guadeloupe
90  973           Guyane
91  974       La Réunion
92  976          Mayotte

[93 rows x 2 columns]

# Places Table

In [53]:
query = "select * from car_accident_staging_db.places"
cursor.execute(query)
data = cursor.fetchall()
col_names = [i[0] for i in cursor.description]
df_places = pd.DataFrame(data, columns = col_names)
df_places.head(10)

,Num_Acc,catr,voie,v1,v2,circ,nbv,pr,pr1,vosp,prof,plan,lartpc,larrout,surf,infra,situ,env1
0,201600000001,3,39,NA,,2,0,NA,NA,0,1,3,0,0,1,0,1,0
1,201600000002,3,39,NA,,1,0,NA,NA,0,1,2,0,58,1,0,1,0
2,201600000003,3,1,NA,,2,2,NA,NA,0,1,3,0,68,2,0,3,99
3,201600000004,4,0,NA,,2,0,NA,NA,0,1,1,0,0,1,0,1,99
4,201600000005,4,0,NA,,0,0,NA,NA,0,0,1,0,0,1,0,1,3
5,201600000006,3,41,NA,,2,0,NA,NA,0,1,1,0,0,1,0,1,99
6,201600000007,3,1,NA,,2,0,NA,NA,0,1,1,70,0,1,0,1,99
7,201600000008,3,2,NA,D,2,2,NA,NA,0,1,1,0,70,1,0,1,0
8,201600000009,4,0,NA,,2,2,NA,NA,0,1,0,0,0,1,0,1,99
9,201600000010,4,0,NA,A,2,0,NA,NA,0,0,1,0,44,7,0,1,0

In [54]:
missing_data(df_places)

         Total NaN Values  Percentage of NaN Values
v2                 806032                 95.957904
v1                 507169                 60.378340
pr1                426522                 50.777335
pr                 425215                 50.621737
voie                59071                  7.032387
lartpc               9545                  1.136330
larrout              8279                  0.985613
nbv                  1790                  0.213099
vosp                 1640                  0.195242
infra                1278                  0.152146
env1                 1276                  0.151907
plan                 1076                  0.128098
prof                 1061                  0.126312
surf                 1017                  0.121074
situ                 1002                  0.119288
circ                  798                  0.095002
catr                    1                  0.000119
Num_Acc                 0                  0.000000

In [55]:
df_places.drop(['v2','v1','pr1','pr','voie','lartpc','env1','nbv','larrout','infra'],axis = 1 , inplace = True)

In [56]:
df_places.head(10)

        Num_Acc catr circ vosp prof plan surf situ
0  201600000001    3    2    0    1    3    1    1
1  201600000002    3    1    0    1    2    1    1
2  201600000003    3    2    0    1    3    2    3
3  201600000004    4    2    0    1    1    1    1
4  201600000005    4    0    0    0    1    1    1
5  201600000006    3    2    0    1    1    1    1
6  201600000007    3    2    0    1    1    1    1
7  201600000008    3    2    0    1    1    1    1
8  201600000009    4    2    0    1    0    1    1
9  201600000010    4    2    0    0    1    7    1

In [57]:
columns_to_convert = ['Num_Acc', 'catr', 'circ', 'vosp', 'prof', 'plan', 'surf','situ']

# Replace non-numeric values with NaN and convert columns to nullable integer type
df_places[columns_to_convert] = df_places[columns_to_convert].apply(pd.to_numeric, errors='coerce').astype('Int64')

In [58]:
#Place Category (catr)

df_places['catr'] = df_places['catr'].replace({2:1})
df_places['catr'] = df_places['catr'].replace({3:2 , 4:2})
df_places['catr'] = df_places['catr'].replace({5:3 , 6:3})


data = {
    "catr": [1, 2, 3, 9],
    "Category": ["Major Roads", "Minor Roads", "Non-Road Network","Other"]
}
df_places_category = pd.DataFrame(data)

df_places_category.to_csv("places_category.csv",index = False)

In [59]:
#Traffic Regime (circ)

df_places["circ"] = df_places["circ"].replace({4: 3})

data = {
    "circ": [0, 1, 2, 3],
    "Traffic": ["Unknown","One way", "Bidirectional", "Separated Traffic"]
}
df_places_traffic = pd.DataFrame(data)

df_places_traffic.to_csv("places_traffic.csv",index = False)

In [60]:
#Reserved Lane (vosp)
data = {
    "vosp": [0, 1, 2, 3],
    "Lane": ["No Lane", "Bike path", "Cycle Bank", "Reserved channel"]
}
df_places_Lane = pd.DataFrame(data)

df_places_Lane.to_csv("places_lane.csv",index = False)

In [61]:
#Road Profile (prof)
data = {
    "prof": [0, 1, 2, 3, 4],
    "Profile": ["Unknown","Dish", "Slope", "Hilltop", "Hill bottom"]
}
df_places_profile = pd.DataFrame(data)

df_places_profile.to_csv("places_profile.csv",index = False)

In [62]:
#Drawing Plan (plan)
data = {
    "plan": [0, 1, 2, 3, 4],
    "DrawingPlan": ["Unknown","Straight", "Curved left", "Curved right", "In S"]
}
df_places_plan = pd.DataFrame(data)

df_places_plan.to_csv("places_plan.csv",index = False)

In [63]:
#Surface Condition (surf)

df_places['surf'] = df_places['surf'].replace({4:3})
df_places['surf'] = df_places['surf'].replace({5:4})
df_places['surf'] = df_places['surf'].replace({8:6, 9:6})
df_places['surf'] = df_places['surf'].replace({7:5})

data = {
    "surf": [0, 1, 2, 3, 4, 5, 6],
    "Surface": ["Unknown","Normal", "Wet", "Flooded","Snow","Icy","Other"]
}
df_places_surface = pd.DataFrame(data)

df_places_surface.to_csv("places_surface.csv",index = False)

In [64]:
#Situation of the accident (situ)

df_places['situ'] = df_places['situ'].replace({3:2})
df_places['situ'] = df_places['situ'].replace({4:3 , 5:3})

data = {
    "situ": [0, 1, 2, 3],
    "Situation": ["Unknown","On the road", "On emergency stop band", "On the sidewalk"]
}
df_places_situation = pd.DataFrame(data)

df_places_situation.to_csv("places_situation.csv",index = False)

In [65]:
df_places.head(10)

        Num_Acc  catr  circ  vosp  prof  plan  surf  situ
0  201600000001     2     2     0     1     3     1     1
1  201600000002     2     1     0     1     2     1     1
2  201600000003     2     2     0     1     3     2     2
3  201600000004     2     2     0     1     1     1     1
4  201600000005     2     0     0     0     1     1     1
5  201600000006     2     2     0     1     1     1     1
6  201600000007     2     2     0     1     1     1     1
7  201600000008     2     2     0     1     1     1     1
8  201600000009     2     2     0     1     0     1     1
9  201600000010     2     2     0     0     1     5     1

# UK Accidents

In [66]:
uk = pd.read_csv('UK_Accident.csv', dtype={'Accident_Index': str})
uk.sample(10)

,Unnamed: 0,Accident_Index,Longitude,Latitude,Accident_Severity,Number_of_Vehicles,Number_of_Casualties,Date,Day_of_Week,Time,Road_Type,Light_Conditions,Weather_Conditions,Road_Surface_Conditions
972274,402263,201134WN07071,-0.897943,52.239305,3,2,2,20/02/2011,1,1:54,One way street,Darkness: Street lights present and lit,Fine without high winds,Wet/Damp
31117,31117,200504CL05021,-2.696311,53.693314,3,2,1,25/06/2005,7,12:15,Single carriageway,Daylight: Street light present,Fine without high winds,Dry
243422,243422,2.01E+12,-2.992197,53.232698,3,2,1,11/1/2006,4,14:29,Dual carriageway,Daylight: Street light present,Fog or mist,Dry
935971,365960,2.01113E+12,-1.830184,53.846938,3,2,1,25/01/2011,3,8:30,Dual carriageway,Daylight: Street light present,Raining without high winds,Wet/Damp
841268,271257,2.01044E+12,-1.419311,51.176367,3,2,1,8/2/2010,2,13:15,Single carriageway,Daylight: Street light present,Fine without high winds,Wet/Damp
196333,196333,200597ND02507,-4.031572,55.812810,3,1,3,25/07/2005,2,21:30,Single carriageway,Daylight: Street light present,Fine without high winds,Dry
29451,29451,200504B002105,-2.750746,53.900976,3,2,1,8/1/2005,7,3:40,Dual carriageway,Darkeness: No street lighting,Raining without high winds,Wet/Damp
506819,506819,200743N199107,-0.970401,51.999988,3,2,1,19/10/2007,6,9:00,Single carriageway,Daylight: Street light present,Fine without high winds,Dry
381456,381456,2.01E+12,-3.962601,55.989716,3,2,1,28/06/2006,4,8:40,Single carriageway,Daylight: Street light present,Fine without high winds,Dry
981342,411331,20114100D0129,-0.506314,51.744954,2,1,1,23/02/2011,4,16:25,Dual carriageway,Daylight: Street light present,Raining without high winds,Wet/Damp

In [67]:
uk['Country'] = 'United Kingdom'

In [68]:
uk['Date'] = pd.to_datetime(uk['Date'], dayfirst=True).dt.strftime('%d/%m/%Y')

In [69]:
uk.drop(['Accident_Severity','Number_of_Casualties','Day_of_Week','Unnamed: 0'],axis = 1 , inplace = True)

In [70]:
uk['Road_Type'] = uk['Road_Type'].replace({ 'Single carriageway': 1 ,
                                            'One way street' : 1 ,
                                              'Dual carriageway': 2 ,
                                              'Slip road': 3 ,
                                              'Roundabout': 0 ,
                                               'Unknown' : 0 })

In [71]:
uk['Light_Conditions'] = uk['Light_Conditions'].replace({'Daylight: Street light present' : 1,
                                                         'Darkness: Street lights present and lit': 5,
                                                         'Darkeness: No street lighting': 3,
                                                          'Darkness: Street lighting unknown':2,
                                                           'Darkness: Street lights present but unlit':4 })

In [72]:
uk["Road_Surface_Conditions"]=uk['Road_Surface_Conditions'].replace({'Dry':1 ,
                                       'Wet/Damp':2,
                                       'Frost/Ice':5,
                                       'Snow':4,
                                       'Flood (Over 3cm of water)':3,
                                       'Normal':1})

In [73]:
uk['Number_of_Vehicles'] = uk['Number_of_Vehicles'].replace({1: 3, 2: 1})

# For all other values (not 1 or 2), set them to 2
uk['Number_of_Vehicles'] = uk['Number_of_Vehicles'].apply(lambda x: 2 if x not in [1, 3] else x)

In [74]:

# Extract the part before the colon (the hour)
uk['Time'] = uk['Time'].str.split(':').str[0]

# Display the first few rows to check the result
uk.head(10)

,Accident_Index,Longitude,Latitude,Number_of_Vehicles,Date,Time,Road_Type,Light_Conditions,Weather_Conditions,Road_Surface_Conditions,Country
0,200501BS00001,-0.191170,51.489096,3,04/01/2005,17,1,1,Raining without high winds,2,United Kingdom
1,200501BS00002,-0.211708,51.520075,3,05/01/2005,17,2,5,Fine without high winds,1,United Kingdom
2,200501BS00003,-0.206458,51.525301,1,06/01/2005,0,1,5,Fine without high winds,1,United Kingdom
3,200501BS00004,-0.173862,51.482442,3,07/01/2005,10,1,1,Fine without high winds,1,United Kingdom
4,200501BS00005,-0.156618,51.495752,3,10/01/2005,21,1,2,Fine without high winds,2,United Kingdom
5,200501BS00006,-0.203238,51.515540,1,11/01/2005,12,1,1,Raining without high winds,2,United Kingdom
6,200501BS00007,-0.211277,51.512695,1,13/01/2005,20,1,5,Fine without high winds,1,United Kingdom
7,200501BS00009,-0.187623,51.502260,3,14/01/2005,17,2,1,Fine without high winds,1,United Kingdom
8,200501BS00010,-0.167342,51.483420,1,15/01/2005,22,1,5,Fine without high winds,1,United Kingdom
9,200501BS00011,-0.206531,51.512443,1,15/01/2005,16,1,1,Fine without high winds,1,United Kingdom

In [75]:
uk['Weather_Conditions'] = uk['Weather_Conditions'].replace({'Fine without high winds' : 'Clear',
                                  'Raining without high winds':'Rain',
                                  'Raining with high winds': 'Thunderstorm',
                                  'Fine with high winds':'Clear',
                                  'Snowing without high winds':'Snow',
                                  'Fog or mist': 'Fog',
                                  'Snowing with high winds':'Snow' 
                                  })

In [76]:
uk = uk.rename(columns={
    'Accident_Index':'Num_Acc',
    'Number_of_Vehicles':'col',
    'Date':'date',
    'Time':'hour',
    'Road_Type':'circ',
    'Light_Conditions':'lum',
    'Road_Surface_Conditions':'surf',
    'Weather_Conditions':'Weather_Conditions_UK'
})

In [77]:
order = ['Num_Acc','date','hour','circ','lum','surf','col','Longitude','Latitude','Weather_Conditions_UK','Country']
uk = uk[order]
uk = uk.dropna()
uk.head(10)

,Num_Acc,date,hour,circ,lum,surf,col,Longitude,Latitude,Weather_Conditions_UK,Country
0,200501BS00001,04/01/2005,17,1,1,2,3,-0.191170,51.489096,Rain,United Kingdom
1,200501BS00002,05/01/2005,17,2,5,1,3,-0.211708,51.520075,Clear,United Kingdom
2,200501BS00003,06/01/2005,0,1,5,1,1,-0.206458,51.525301,Clear,United Kingdom
3,200501BS00004,07/01/2005,10,1,1,1,3,-0.173862,51.482442,Clear,United Kingdom
4,200501BS00005,10/01/2005,21,1,2,2,3,-0.156618,51.495752,Clear,United Kingdom
5,200501BS00006,11/01/2005,12,1,1,2,1,-0.203238,51.515540,Rain,United Kingdom
6,200501BS00007,13/01/2005,20,1,5,1,1,-0.211277,51.512695,Clear,United Kingdom
7,200501BS00009,14/01/2005,17,2,1,1,3,-0.187623,51.502260,Clear,United Kingdom
8,200501BS00010,15/01/2005,22,1,5,1,1,-0.167342,51.483420,Clear,United Kingdom
9,200501BS00011,15/01/2005,16,1,1,1,1,-0.206531,51.512443,Clear,United Kingdom

# Weather Table

In [78]:
df_weather = pd.read_csv('france_weather_data.csv')
df_weather

,Date,Region,Temperature (°C),Humidity (%),Wind Speed (m/s),Precipitation (mm),Visibility (meters),Weather Condition,Pressure (hPa),Sunshine Duration (hours)
0,2005-01-01,Hauts-de-France,3.002578,84,1.808504,0.000000,9535,Fog,974.2,3.3
1,2005-01-01,Grand Est,0.465835,32,5.020220,17.030382,3185,Snow,957.1,1.6
2,2005-01-01,Normandie,10.251541,98,5.078608,84.141024,4243,Rain,1008.2,3.5
3,2005-01-01,Bretagne,23.631614,38,2.857007,0.000000,7552,Clear,954.3,3.4
4,2005-01-01,Île-de-France,17.252105,97,4.790668,39.657001,4579,Drizzle,1022.2,5.1
...,...,...,...,...,...,...,...,...,...,...
78889,2016-12-31,Martinique,-3.782856,77,4.887443,43.462003,124,Snow,1008.7,3.1
78890,2016-12-31,Guadeloupe,7.613009,74,0.704278,0.000000,5511,Fog,990.4,3.2
78891,2016-12-31,Guyane,18.300000,47,14.200000,26.600000,4696,Cloudy,1025.8,10.5
78892,2016-12-31,La Réunion,22.327094,80,11.290223,45.203768,5170,Thunderstorm,1005.9,8.0
78893,2016-12-31,Mayotte,11.325113,59,5.695343,64.378668,476,Rain,1000.6,10.8

In [79]:
df_weather = df_weather.rename(columns={'Date':'date',
                                'Region':'region'})

# Fact Table

In [80]:
fact = pd.merge(df_characteristics,df_regions,on = 'dep',how = 'inner')

In [81]:
fact.sample(10)

,Num_Acc,lum,inter,col,dep,Country,date,hour,region
275156,201600048461,1,1,3,690,France,13/06/2016,14,Auvergne-Rhône-Alpes
213804,200900009937,3,1,3,640,France,09/05/2009,1,Nouvelle-Aquitaine
161112,201100040423,2,3,1,720,France,06/10/2011,8,Pays de la Loire
410813,201600050815,1,1,2,130,France,01/08/2016,14,Provence-Alpes-Côte d'Azur
232708,200700065121,1,3,2,870,France,10/10/2007,10,Nouvelle-Aquitaine
264908,200500044736,1,2,1,380,France,05/07/2005,13,Auvergne-Rhône-Alpes
763718,200600035515,5,1,4,750,France,27/06/2006,23,Île-de-France
271945,200500082039,1,2,1,650,France,13/12/2005,16,Occitanie
418411,201400016529,1,1,3,130,France,10/05/2014,16,Provence-Alpes-Côte d'Azur
657061,201600046245,3,1,3,930,France,10/10/2016,5,Île-de-France

In [82]:
fact.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800622 entries, 0 to 800621
Data columns (total 9 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   Num_Acc  800622 non-null  Int64
 1   lum      800622 non-null  Int64
 2   inter    800622 non-null  Int64
 3   col      800622 non-null  Int64
 4   dep      800622 non-null  Int64
 5   Country  800622 non-null  object
 6   date     800622 non-null  object
 7   hour     800622 non-null  int64
 8   region   800622 non-null  object
dtypes: Int64(5), int64(1), object(3)
memory usage: 58.8+ MB

In [83]:
fact = pd.merge(fact,df_places,on = 'Num_Acc',how = 'inner')

In [84]:
fact.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800622 entries, 0 to 800621
Data columns (total 16 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   Num_Acc  800622 non-null  Int64
 1   lum      800622 non-null  Int64
 2   inter    800622 non-null  Int64
 3   col      800622 non-null  Int64
 4   dep      800622 non-null  Int64
 5   Country  800622 non-null  object
 6   date     800622 non-null  object
 7   hour     800622 non-null  int64
 8   region   800622 non-null  object
 9   catr     800621 non-null  Int64
 10  circ     799841 non-null  Int64
 11  vosp     799035 non-null  Int64
 12  prof     799584 non-null  Int64
 13  plan     799573 non-null  Int64
 14  surf     799629 non-null  Int64
 15  situ     799667 non-null  Int64
dtypes: Int64(12), int64(1), object(3)
memory usage: 106.9+ MB

In [85]:
fact = fact.dropna()

In [86]:
fact.info()

<class 'pandas.core.frame.DataFrame'>
Index: 798674 entries, 0 to 800621
Data columns (total 16 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   Num_Acc  798674 non-null  Int64
 1   lum      798674 non-null  Int64
 2   inter    798674 non-null  Int64
 3   col      798674 non-null  Int64
 4   dep      798674 non-null  Int64
 5   Country  798674 non-null  object
 6   date     798674 non-null  object
 7   hour     798674 non-null  int64
 8   region   798674 non-null  object
 9   catr     798674 non-null  Int64
 10  circ     798674 non-null  Int64
 11  vosp     798674 non-null  Int64
 12  prof     798674 non-null  Int64
 13  plan     798674 non-null  Int64
 14  surf     798674 non-null  Int64
 15  situ     798674 non-null  Int64
dtypes: Int64(12), int64(1), object(3)
memory usage: 112.7+ MB

In [87]:
fact['date'] = pd.to_datetime(fact['date'], format='%d/%m/%Y')
df_weather['date'] = pd.to_datetime(df_weather['date'], format='%Y-%m-%d')

fact = merged_df = pd.merge(
    fact, 
    df_weather, 
    left_on=['date', 'region'], 
    right_on=['date', 'region'], 
    how='left'
)
fact.head(10)

,Num_Acc,lum,inter,col,dep,Country,date,hour,region,catr,...,surf,situ,Temperature (°C),Humidity (%),Wind Speed (m/s),Precipitation (mm),Visibility (meters),Weather Condition,Pressure (hPa),Sunshine Duration (hours)
0,201600000001,1,1,1,590,France,2016-02-01,14,Hauts-de-France,2,...,1,1,7.038908,97,9.926721,54.375792,6726,Rain,1017.6,5.4
1,201600000002,1,6,3,590,France,2016-03-16,18,Hauts-de-France,2,...,1,1,5.419049,83,5.495472,62.644761,8009,Rain,1007.2,0.1
2,201600000003,1,1,3,590,France,2016-07-13,19,Hauts-de-France,2,...,2,2,21.303721,62,18.597796,40.055641,1524,Thunderstorm,1016.0,1.6
3,201600000004,2,1,1,590,France,2016-08-15,19,Hauts-de-France,2,...,1,1,14.147717,87,3.002046,66.728976,5909,Rain,999.9,5.9
4,201600000005,1,3,1,590,France,2016-12-23,11,Hauts-de-France,2,...,1,1,2.474294,95,0.887693,0.000000,3586,Fog,966.7,6.9
5,201600000006,1,1,3,590,France,2016-12-23,11,Hauts-de-France,2,...,1,1,2.474294,95,0.887693,0.000000,3586,Fog,966.7,6.9
6,201600000007,1,1,1,590,France,2016-05-01,11,Hauts-de-France,2,...,1,1,4.925946,85,2.322433,0.000000,6540,Fog,1034.0,11.5
7,201600000008,2,1,1,590,France,2016-05-14,19,Hauts-de-France,2,...,1,1,9.245914,96,9.512710,65.853310,2993,Rain,1034.1,9.9
8,201600000009,1,1,1,590,France,2016-09-23,19,Hauts-de-France,2,...,1,1,20.907362,75,2.510491,0.000000,6181,Clear,1031.1,3.4
9,201600000010,1,1,3,590,France,2016-12-30,10,Hauts-de-France,2,...,5,1,4.179156,99,0.153255,0.000000,3029,Fog,1044.9,9.0

In [88]:
fact = fact[['Num_Acc','date','region','hour','dep','Country','lum','inter','col','catr','circ','vosp','prof','plan','surf','situ','Temperature (°C)','Visibility (meters)','Weather Condition']]
fact.sample(10)

,Num_Acc,date,region,hour,dep,Country,lum,inter,col,catr,circ,vosp,prof,plan,surf,situ,Temperature (°C),Visibility (meters),Weather Condition
35253,201200005112,2012-05-28,Hauts-de-France,7,20,France,1,6,1,2,0,0,0,0,0,1,18.087005,237,Thunderstorm
337861,200700019365,2007-04-11,Auvergne-Rhône-Alpes,2,30,France,3,1,4,1,2,0,1,1,1,2,4.176461,6390,Fog
162094,200700020323,2007-04-24,Pays de la Loire,14,720,France,1,1,1,2,2,0,1,1,1,1,3.189933,4115,Fog
353758,201200040324,2012-03-24,Grand Est,17,880,France,1,6,1,2,2,0,1,3,1,1,9.081406,9863,Drizzle
418787,201300014184,2013-04-09,Provence-Alpes-Côte d'Azur,18,130,France,1,1,1,2,2,0,1,1,1,1,22.851226,6839,Thunderstorm
647329,200700079532,2007-12-29,Île-de-France,19,920,France,5,1,2,1,3,0,1,1,1,1,13.003136,9831,Rain
294238,200700066546,2007-10-04,Auvergne-Rhône-Alpes,14,690,France,1,1,1,1,1,0,1,1,2,1,5.682795,6068,Fog
633430,201200042829,2012-11-06,Île-de-France,12,920,France,1,1,1,2,1,0,1,1,1,1,1.101252,859,Snow
533987,200800017387,2008-04-17,Corse,9,202,France,1,1,1,1,2,0,2,2,1,1,25.090466,1878,Clear
100366,201600043810,2016-04-02,Île-de-France,23,940,France,5,3,3,2,3,0,1,1,2,1,5.753162,8659,Fog

In [89]:
uk = uk.reset_index(drop=True)  # Ensure the index starts from 0
uk['Num_Acc'] = uk.index + 1  # Reset Num_Acc to start from 1
uk['Num_Acc'] = uk['Num_Acc'].astype(str)
final_fact = pd.concat([fact,uk], ignore_index=True)

final_fact['date'] = pd.to_datetime(final_fact['date'], errors='coerce')  # Convert to datetime, coerce errors
final_fact['date'] = final_fact['date'].dt.strftime('%Y-%m-%d')

final_fact.sample(10)

,Num_Acc,date,region,hour,dep,Country,lum,inter,col,catr,...,prof,plan,surf,situ,Temperature (°C),Visibility (meters),Weather Condition,Longitude,Latitude,Weather_Conditions_UK
1151506,352833,2006-01-21,NaN,15,<NA>,United Kingdom,1,<NA>,3,<NA>,...,<NA>,<NA>,1,<NA>,NaN,NaN,NaN,-4.187380,50.401582,Clear
655099,201600046163,2016-09-19,Île-de-France,14,930,France,1,1,2,1,...,1,1,1,1,16.500604,138.0,Clear,NaN,NaN,NaN
479745,200700048781,2007-08-13,Provence-Alpes-Côte d'Azur,22,60,France,5,3,1,2,...,1,1,1,0,1.180444,4743.0,Fog,NaN,NaN,NaN
1529265,730592,2009-08-06,NaN,20,<NA>,United Kingdom,1,<NA>,3,<NA>,...,<NA>,<NA>,1,<NA>,NaN,NaN,NaN,-4.471213,55.929604,Clear
1579855,781182,2010-08-17,NaN,19,<NA>,United Kingdom,1,<NA>,1,<NA>,...,<NA>,<NA>,1,<NA>,NaN,NaN,NaN,-1.113496,53.933577,Clear
1780799,982126,2011-01-17,NaN,0,<NA>,United Kingdom,5,<NA>,1,<NA>,...,<NA>,<NA>,2,<NA>,NaN,NaN,NaN,-0.261057,51.651028,Rain
1682281,883608,2010-06-28,NaN,18,<NA>,United Kingdom,1,<NA>,3,<NA>,...,<NA>,<NA>,3,<NA>,NaN,NaN,NaN,-4.326723,55.877504,Rain
242653,201100026746,2011-08-01,Occitanie,18,310,France,1,3,1,2,...,1,1,1,0,18.829677,7957.0,Thunderstorm,NaN,NaN,NaN
162697,200600007345,2006-02-24,Pays de la Loire,8,720,France,1,1,1,1,...,1,1,1,1,6.195150,7019.0,Rain,NaN,NaN,NaN
1264153,465480,2007-04-03,NaN,19,<NA>,United Kingdom,5,<NA>,1,<NA>,...,<NA>,<NA>,2,<NA>,NaN,NaN,NaN,-1.918936,52.665611,Thunderstorm

In [90]:
final_fact.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1847044 entries, 0 to 1847043
Data columns (total 22 columns):
 #   Column                 Dtype
---  ------                 -----
 0   Num_Acc                object
 1   date                   object
 2   region                 object
 3   hour                   object
 4   dep                    Int64
 5   Country                object
 6   lum                    Int64
 7   inter                  Int64
 8   col                    Int64
 9   catr                   Int64
 10  circ                   Int64
 11  vosp                   Int64
 12  prof                   Int64
 13  plan                   Int64
 14  surf                   Int64
 15  situ                   Int64
 16  Temperature (°C)       float64
 17  Visibility (meters)    float64
 18  Weather Condition      object
 19  Longitude              float64
 20  Latitude               float64
 21  Weather_Conditions_UK  object
dtypes: Int64(11), float64(4), object(7)
memory usage: 329.4+ MB

# JOINING USERS AND VEHICLES

In [91]:
df_users['Num_Acc'] = df_users['Num_Acc'].astype(str)  # Converting to string
new_df_vehicles['Num_Acc'] = new_df_vehicles['Num_Acc'].astype(str)  # Converting to string

users_dm = pd.merge(df_users,new_df_vehicles,on = ['Num_Acc','num_veh'])

In [92]:
users_dm.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1749881 entries, 0 to 1749880
Data columns (total 14 columns):
 #   Column            Dtype
---  ------            -----
 0   Num_Acc           object
 1   catu              Int64
 2   grav              Int64
 3   sexe              object
 4   trajet            Int64
 5   secu              object
 6   an_nais           Int64
 7   num_veh           object
 8   safety_existence  Int64
 9   safety_use        Int64
 10  catv              int64
 11  car_condition     object
 12  wheels_condition  object
 13  vehicle_company   object
dtypes: Int64(6), int64(1), object(7)
memory usage: 196.9+ MB

In [93]:
users_dm['Num_Acc'].value_counts()

Num_Acc
200600016834    86
200600074917    84
200500043044    69
201200012891    68
200700051728    64
                ..
201400025357     1
200600002962     1
200600002963     1
201100031097     1
200800020959     1
Name: count, Length: 828480, dtype: int64

# Users Dimensional Table

In [94]:
# After the cleaning and transformation of df_users I linked it to new_df_vehicles(on Num_Acc and num_veh) then I added age, speed and survival rate 
users_dm = pd.read_csv('dm_users.csv')
users_dm.drop(['user_id'],axis = 1 , inplace= True)
users_dm.head(10)

,Unnamed: 0,Num_Acc,catu,grav,sexe,trajet,secu,an_nais,num_veh,safety_existence,safety_use,catv,car_condition,wheels_condition,vehicle_company,age,speed,survival_rate
0,0,201600000001,1,1,2,0,11,1983,B02,1,1,2,Average,Poor,Citroën,41,58,100.000000
1,1,201600000001,1,3,1,9,21,2001,A01,2,1,1,Poor,Average,Ducati,23,46,44.886786
2,2,201600000002,1,3,1,5,11,1960,A01,1,1,2,Poor,Average,Citroën,64,52,42.569540
3,3,201600000002,2,3,1,0,11,2000,A01,1,1,2,Poor,Average,Citroën,24,83,21.263364
4,4,201600000002,2,3,2,0,11,1962,A01,1,1,2,Poor,Average,Citroën,62,118,1.189220
5,5,201600000003,1,1,1,1,11,1997,A01,1,1,2,Average,Average,Tesla,27,122,75.000000
6,6,201600000004,1,3,1,5,23,1999,B02,2,3,1,Poor,Average,Yamaha,25,79,16.375128
7,7,201600000004,2,4,1,0,23,1999,B02,2,3,1,Poor,Average,Yamaha,25,40,84.251090
8,8,201600000004,1,1,2,0,11,1985,A01,1,1,2,Poor,Average,BMW,39,113,60.000000
9,9,201600000005,1,3,2,3,21,1957,B02,2,1,1,Good,Good,Ducati,67,42,76.876042

In [95]:
users_dm.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1409466 entries, 0 to 1409465
Data columns (total 18 columns):
 #   Column            Non-Null Count    Dtype
---  ------            --------------    -----
 0   Unnamed: 0        1409466 non-null  int64
 1   Num_Acc           1409466 non-null  int64
 2   catu              1409466 non-null  int64
 3   grav              1409466 non-null  int64
 4   sexe              1409466 non-null  int64
 5   trajet            1409466 non-null  int64
 6   secu              1409466 non-null  int64
 7   an_nais           1409466 non-null  int64
 8   num_veh           1409466 non-null  object
 9   safety_existence  1409466 non-null  int64
 10  safety_use        1409466 non-null  int64
 11  catv              1409466 non-null  int64
 12  car_condition     1409466 non-null  object
 13  wheels_condition  1409466 non-null  object
 14  vehicle_company   1409466 non-null  object
 15  age               1409466 non-null  int64
 16  speed             1409466 non-null  int64
 17  survival_rate     1409466 non-null  float64
dtypes: float64(1), int64(13), object(4)
memory usage: 193.6+ MB

In [96]:
users_dm['user_id'] = range(1, len(users_dm) + 1)

# Reorder columns to place 'user_id' as the first column
users_dm = users_dm[['user_id'] + [col for col in users_dm.columns if col != 'user_id']]

In [97]:
# To have the same speed for users in the same vehicles
users_dm['speed'] = users_dm.groupby('Num_Acc')['speed'].transform('mean')

In [98]:
users_dm.head(10)

,user_id,Unnamed: 0,Num_Acc,catu,grav,sexe,trajet,secu,an_nais,num_veh,safety_existence,safety_use,catv,car_condition,wheels_condition,vehicle_company,age,speed,survival_rate
0,1,0,201600000001,1,1,2,0,11,1983,B02,1,1,2,Average,Poor,Citroën,41,52.000000,100.000000
1,2,1,201600000001,1,3,1,9,21,2001,A01,2,1,1,Poor,Average,Ducati,23,52.000000,44.886786
2,3,2,201600000002,1,3,1,5,11,1960,A01,1,1,2,Poor,Average,Citroën,64,84.333333,42.569540
3,4,3,201600000002,2,3,1,0,11,2000,A01,1,1,2,Poor,Average,Citroën,24,84.333333,21.263364
4,5,4,201600000002,2,3,2,0,11,1962,A01,1,1,2,Poor,Average,Citroën,62,84.333333,1.189220
5,6,5,201600000003,1,1,1,1,11,1997,A01,1,1,2,Average,Average,Tesla,27,122.000000,75.000000
6,7,6,201600000004,1,3,1,5,23,1999,B02,2,3,1,Poor,Average,Yamaha,25,77.333333,16.375128
7,8,7,201600000004,2,4,1,0,23,1999,B02,2,3,1,Poor,Average,Yamaha,25,77.333333,84.251090
8,9,8,201600000004,1,1,2,0,11,1985,A01,1,1,2,Poor,Average,BMW,39,77.333333,60.000000
9,10,9,201600000005,1,3,2,3,21,1957,B02,2,1,1,Good,Good,Ducati,67,71.666667,76.876042

In [99]:
users_dm['speed'] = users_dm['speed'].astype('int')
users_dm['survival_rate'] = users_dm['survival_rate'].round(2)

In [100]:
users_dm.drop(['secu','Unnamed: 0'], axis = 1, inplace=True)

In [101]:
users_dm['Num_Acc']=users_dm['Num_Acc'].astype('str')

# Loading Tables To SQL

In [102]:
connection_string = create_connection("localhost", "root", "root", "car_accident_dwh")
cursor = source_conn.cursor()
engine1 = create_engine(f'mysql+pymysql://root:root@localhost:3306/car_accident_dwh')

Connection successful

In [103]:
# Normalized Table
users_category_df = pd.read_csv('users_category.csv')
users_severity_df = pd.read_csv('users_severity.csv')
users_reason_df = pd.read_csv('users_reason.csv')
users_safety_existence_df = pd.read_csv('users_safety_existence.csv')
users_safety_use_df = pd.read_csv('users_safety_use.csv')
vehicles_category_df = pd.read_csv('vehicles_category.csv')
characteristic_lighting_df = pd.read_csv('Characteristic_lighting.csv')
characteristic_intersection_df = pd.read_csv('Characteristic_intersection.csv')
characteristic_collision_df = pd.read_csv('Characteristic_collision.csv')
places_situation_df = pd.read_csv('places_situation.csv')
places_category_df = pd.read_csv('places_category.csv')
places_traffic_df = pd.read_csv('places_traffic.csv')
places_lane_df = pd.read_csv('places_lane.csv')
places_profile_df = pd.read_csv('places_profile.csv')
places_plan_df = pd.read_csv('places_plan.csv')
places_surface_df = pd.read_csv('places_surface.csv')

In [104]:
# Correct the mapping for 'places_profile'
tables = [
    (users_category_df, 'users_category'),
    (users_severity_df, 'users_severity'),
    (users_reason_df, 'users_reason'),
    (users_safety_existence_df, 'users_safety_existence'),
    (users_safety_use_df, 'users_safety_use'),
    (vehicles_category_df, 'vehicles_category'),
    (characteristic_lighting_df, 'characteristic_lighting'),
    (characteristic_intersection_df, 'characteristic_intersection'),
    (characteristic_collision_df, 'characteristic_collision'),
    (places_situation_df,'places_situation'),
    (places_category_df, 'places_category'),
    (places_traffic_df, 'places_traffic'),
    (places_lane_df, 'places_lane'),
    (places_profile_df, 'places_profile'),
    (places_plan_df, 'places_plan'),
    (places_surface_df, 'places_surface'),
]

In [113]:
for df, table_name in tables:
    df.to_sql(table_name, con=engine1, if_exists='append', index=False)
    print(f'Data inserted into {table_name} successfully.')

Data inserted into users_category successfully.
Data inserted into users_severity successfully.
Data inserted into users_reason successfully.
Data inserted into users_safety_existence successfully.
Data inserted into users_safety_use successfully.
Data inserted into vehicles_category successfully.
Data inserted into characteristic_lighting successfully.
Data inserted into characteristic_intersection successfully.
Data inserted into characteristic_collision successfully.
Data inserted into places_situation successfully.
Data inserted into places_category successfully.
Data inserted into places_traffic successfully.
Data inserted into places_lane successfully.
Data inserted into places_profile successfully.
Data inserted into places_plan successfully.
Data inserted into places_surface successfully.

In [114]:
df_weather = df_weather.rename(columns={'Temperature (°C)':'temperature_C',
                                        'Humidity (%)':'humidity_Percent',
                                        'Wind Speed (m/s)':'wind_Speed_m_s',
                                        'Precipitation (mm)':'precipitation_mm',
                                        'Visibility (meters)':'visibility_meters',
                                        'Weather Condition':'weather_Condition',
                                        'Pressure (hPa)':'pressure_hPa',
                                        'Sunshine Duration (hours)':'sunshine_Duration_hours'
                                
})

In [115]:
df_weather.to_sql('weather', con=engine1, if_exists='append', index=False)

78894

In [116]:
final_fact['Num_Acc'] = final_fact['Num_Acc'].astype('str')

In [117]:
final_fact = final_fact.rename(columns = {'Temperature (°C)':'temperature_C',
                                         'Visibility (meters)' :'visibility_meters',
                                         'Weather Condition':'weather_Condition'
                                            } )

In [118]:
final_fact['Num_Acc'].value_counts()

Num_Acc
201600000001    1
432727          1
432697          1
432696          1
432695          1
               ..
200800049826    1
200800049689    1
200800049688    1
200800049687    1
1048370         1
Name: count, Length: 1847044, dtype: int64

In [119]:
missing_num_acc = users_dm[~users_dm['Num_Acc'].isin(final_fact['Num_Acc'])]
missing_num_acc

,user_id,Num_Acc,catu,grav,sexe,trajet,an_nais,num_veh,safety_existence,safety_use,catv,car_condition,wheels_condition,vehicle_company,age,speed,survival_rate
648,649,201600000323,1,3,1,5,1998,A01,1,1,2,Average,Average,Ford,26,57,64.11
649,650,201600000323,1,3,2,5,1994,B02,1,1,3,Poor,Average,Renault,30,57,49.12
650,651,201600000324,1,3,1,5,1947,A01,2,1,1,Average,Poor,Kawasaki,77,87,17.70
651,652,201600000325,1,3,1,9,1990,A01,1,1,2,Good,Average,Peugeot,34,125,26.70
652,653,201600000325,2,3,1,0,1993,A01,1,1,2,Good,Average,Peugeot,31,125,27.27
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1404946,1404947,200500083360,1,4,2,9,1976,A01,2,1,2,Poor,Average,Mercedes-Benz,48,94,57.83
1404947,1404948,200500083361,1,1,1,9,1976,B01,1,1,2,Good,Good,Nissan,48,56,100.00
1404948,1404949,200500083362,1,1,1,5,1970,A01,1,1,1,Poor,Good,Ducati,54,73,85.00
1404949,1404950,200500083362,1,1,1,5,1970,A01,1,1,2,Average,Poor,Citroën,54,73,100.00
1404950,1404951,200500083365,1,4,2,3,1935,A01,4,3,2,Poor,Poor,Volkswagen,89,106,21.38

In [120]:
users_dm = users_dm[users_dm['Num_Acc'].isin(final_fact['Num_Acc'])]

In [121]:
final_fact.to_sql('fact_table',con = engine1,if_exists='append',index = False)

1847044

In [122]:
users_dm.to_sql('users_dm',con = engine1,if_exists='append',index = False )

1338024

In [123]:
final_fact.to_csv('final_fact.csv')

In [125]:
users_dm.to_csv('final_users.csv')